package DAY09.EX01_TryCatch예외상황;

public class A예외처리메모 {
	/**
	 * 
	 * 에러 [Error]
	 *  1. 컴파일 에러 compile Error (빨갈줄에러)  : 컴파일하는 과정에서 발생하는 오류, 프로그램 실행 불가
	 *  (프로그램 문법에 맞지 않는 코드를 작성한 경우),(실행문 끝에 ; 누락),(선언하지않는 변수 사용 등 )
	 *  
	 *  2 런타임 에러 Runtime Error	: 프로그램실행 과정에서 발생하는 오류, 사용자 문제거나(컴퓨터)/ 프로그램 자체 오류
	 *  분류 : 에러Error , 예외 Exception
	 *  
	 *  예외Exception 정리
	 *   프로그램 샐행 중에 에상치 못하게 발생한 상황
	 *   - 예외가 발생되면 프로그램 진행이 중단됨
	 *   - 예외 발생 가능성 있는 문장을 파악하여 대응 가능
	 *   ex) 숫자를 0으로 나누는 경우, 배열의 접근 할수 없는 index를 접근하는경우, 정수 입력 메소드에 문자가 입력된경우 등,
	 *   
	 *   예외처리(Exception Handling)  :  발생한 예외에 대해서 프로그램 코드로 대응 하는것
	 *   
	 * 		 try{
	 * 		 예외발생할 가능성이 있는 문장
	 * 	 	}
	 * 		 catch(예외 타입 변수명){
	 * 		 예외처리문장
	 *  	}
	 * 		 finally{
	 * 	 	예외여부와 무관하게 실행할 문장}
	 */

}

