package DAY07.EX03_중첩클래스;

public class 중첩클래스메모 {
	/*
	 * 클래스 내부에 선언한 클래스
	 * 언제 쓰이냐 ? : 특정 클래스에 의존하는 클래스를 정의할때 사용
	 * - 상위클래스 내부에서 의지하며 사용될때 사용
	 * 
	 * 바깥 클래스 outer Class (메인처럼) / 안쪽 클래스 inner Class
	 * 
	 * 
	 * 멤버 클래스 종류
	 * 로컬클래스: 아우터가 생성되야 이너클래스를 사용할수있음 (인스턴스)
	 * 이너클래스는 : 아우터가 생성되지 않아도 static을 사용하면 이너 사용가능(static 이너 클래스)
	 * : A a = new A();       A.a 
	 * 
	 * 
	 * 
	 */
	
	void methods( ) {
		//a class
	}
	//**로컬 클래스 도 있음 얘는 특이하게 메소드가 실행될때 사용; (a class)
}



